'use strict';

// eslint-disable-next-line no-unused-vars
const config = {
  style: 'mapbox://styles/mapbox/light-v10',
  accessToken:
    'pk.eyJ1IjoidmlzYXJ1dCIsImEiOiJjbGFmbWdnOXoxNW14M3BtaXQ4N2V0b3QyIn0.zBTqylkGLBGZN07y8jfBUg',
  CSV: './Mor Lum data - test (2).csv',
  center: [102.823, 16.451],
  zoom: 8,
  title: 'หมอลำใกล้ฉัน',
  description:
    'คิวงานหมอลำและคอนเสิร์ตประจำวันที่ 27 กุมภาพันธ์ 2567 โดย ดีเจบ่าวฟากซี คิวงานอาจมีการเปลี่ยนแปลงโดยไม่แจ้งให้ทราบล่วงหน้าตามสถานการณ์ครับ เพื่อความชัวร์ให้เช็คกับศิลปินนักร้องก่อนไป และข้อมูลรู้แค่เอาลง',
  sideBarInfo: ['Band', 'location name', 'province'],
  popupInfo: ['location name'],
  popupInfo: ['Band'],
  //ฟิลเตอร์ตัวที่ 1
  filters: [
    {
      type: 'dropdown',
      title: 'คณะหมอลำ: ',
      columnHeader: 'Band',
      listItems: [
        'ศิลปินภูไท',
        'อีสานนครศิลป์',
        'ระเบียบวาทะศิลป์',
        'ประถมบันเทิงศิลป์',
        'ซานเล้าบันเทิงศิลป์',
        'คำผุนร่วมมิตร',
        'สาวน้อยเพชรบ้านแพง',
        'หมอลำใจเกินร้อย',
        'เสียงอิสาน',
        'หมอลำเสียงวิหค',
        'เอ อนุชา ราศรี นุ่นธิดาพร สายรักษ์ ศรีนคร',
        'ใหม่พัชรี ไชยเลิศ',
        'ทวีศักดิ์ ทังโส',
        'รำวงย้อนยุค',
        'ดาวรุ่ง เพชรน้ำหนึ่ง',
        'รถแห่ย่องเบาซุปเปอร์บิ๊ก',
        'มยุรี ดาวกระจาย',
        'น้ำแข็ง ทิพวรรณ',
        'อิงอร มิวสิคโกลด์',
      ],
    },

    //ฟิลเตอร์ตัวที่ 2
    {
      type: 'dropdown',
      title: 'จังหวัด: ',
      columnHeader: 'province',
      listItems: [
        'กาฬสินธุ์',
        'ชลบุรี',
        'นครพนม',
        'นครราชสีมา',
        'บึงกาฬ',
        'บุรีรัมย์',
        'ยโสธร',
        'ร้อยเอ็ด',
        'ศรีสะเกษ',
        'สุรินทร์',
        'สกลนคร',
        'สุรินทร์',
        'หนองคาย',
        'อุดรธานี',
        'อุบลราชธานี',
      ],
    },

    //ฟิลเตอร์ตัวที่ 3
    {
      type: 'dropdown',
      title: 'เวลาการแสดง: ',
      columnHeader: 'time',
      listItems: [
        'กลางวัน',
        'กลางคืน',
        'บ่าย',
      ],
    },
  ],
};
